<?php
/**
 * Created by PhpStorm.
 * User: Sergey Ponidelnik
 * Date: 27/06/2018
 * Time: 09:52
 */

namespace App\Core\Tables;


class MarketerTable extends Table
{
    protected $name = 'Торговцы на городском рынке';
    protected $data = [
        'Несколько крыс прибито за хвост к стенке тележки, у которой стоит потрепанного вида мужик. При вашем приближении, он кричит: "Крыса на палочке - 1 медяк, очень питательно!"',
        'Тележка полна фруктов, которые выглядят мягкими и переспелыми, впрочем они все еще съедобны.',
        'Большая груда погнутых столовых приборов, горшков со сколами и другого хлама возвышается над прилавком. Мужчина с закрученными усами и отсутствующим зубом замечает ваш взгляд и говорит: "Практически целые вещички, сэр? По очень разумным ценам!"',
        'Множество крысинно-серых поеденных молью щурок расятнуто на заднем борту телеги. Если сшить несолько из них вместе, может быть вы получите скромную теплую одежду.',
        'Несколько пыльных бутылок сложено в дальнем углу лотка. Кто-то сделал грубые наброски виноградных гроздей на них.',
        'С лотка продают свежий хлеб, однако, приблизившись вы видите, как кто-то из купивших хлеб, укусил его, громко ругнуся и выплюнул несколько маленьких камней.',
        'В телеге лежат куски мяса в разном состянии, у некоторых неприятный зеленоватый отенок, а над ними лениво жужжат крупные мухи.',
        'В шаткой тележке стоят кружки, пустые боченки и даже несколько вывесок, которые были сняты с закрывшихся таверн.',
        'В деревяннной тележке бепорядочной кучей свалены простыни, наволочки, занавески, одежда. На некоторых предметах есть маленькие пятнышки, похожие на засохшую кровь.',
        'В тележке видны шерстяные мешки, железные гвозди, набор молотков. Продавец выкрикивает: "Сломалось колесо телеги? Лошадь потеряла подкову? У нас есть все, что вам нужно!"',
        'Сначала вы ощущаете сильный запах, а потом видите торговца продающего соленую рыбу.',
        'На борту телеги виднеется надпись "Приют Должника", в самой телеге лежат три тела, а рядом стоит большой человек в фартуке и с клещами в руках, он замечает вас и улыбается, показывая идеальные белые зубы.',
        'По бортам телеги развешаны тушки кроликов, уток и прочей дичи, которые очевидно были добыты (возможно браконьерами) в лесах неподалеку. В телеге еще больше добычи.',
        'Скользкий на вид господин продает со своего ярораскрашенного фургона чудо-эликсир исцеляющий от всего. В толпе виден сгорбленный страничек с палочкой, как только он принял образец эликсира, так он закричал от радости, отбросил трость и бодро шагает по улице.',
        'Как только вы приближаетесь, торговец приветствует вас и говорит, что продает "Сокровища Глубин" - предметы добытые его командой исследователей из затонувших кораблей. Ассортимент состоит из сильно изъеденных медных светильников, нескольких запечатанных бочонков рома, и деревянной фигуры женщины с отслаивающейся краской.',
        'С лотка пробаются восхитительно-пахнужие пирожки с мясом. Всякая попытка ужнать о происхождении начинки встречается милой и понимающей улыбкой продавщицы.',
        'На обочине дороги мальчик продает уличного вида котят из коробки.',
        'Местный художник пытается продать эскизы нескольких своих картин, так же он предлагает прохожим нарисовать их портрет углем всего за 5 серебрянных.',
        'Большая толпа не дает увидеть, что именно продается в этом лотке. Продавец окружен рассерженными людьми, требующими вернуть им деньги за испорченный товар. Похоже, в любой момент может начаться мордобой.',
        'Покупателям предлагается ассортимент потрепанного оружия и доспехов. Они продаются за три четверти цены, но при их использовании есть шанс в 25% (во время битвы), что вещь просто рассыпется на куски.'
    ];
}